package com.itsi.almuntaqimorevn.model

class DuaData {

    companion object {
        const val hardcodedJsonDataAsString: String = """
    [
      {
        "ch_id": 0,
        "ch_name": "باب الأذكار الصحيحة عن رسول الله ﷺ من أذكار الصباح والمساء (1) ",
        "ch_evidence": "",
        "duas": [
          {
            "id": 1,
            "quranic": false,
            "dua": "«اللهم أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ»",
            "evidence": "رواه البخاري (٦۳۰٦)؛ عن شَدَّاد بْنُ أَوْسٍ رضي الله عنه : عَنِ النَّبِيِّ ﷺ: «سَيِّدُ الِاسْتِغْفَارِ أَنْ تَقُولَ: اللهم أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ» قَالَ: «وَمَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا، فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ، وَمَنْ قَالَهَا مِنَ اللَّيْلِ وَهُوَ مُوقِنٌ بِهَا، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ، فَهُوَ مِنْ أَهْلِ الجَنَّةِ»"
          },
          {
            "id": 2,
            "quranic": false,
            "dua": "«أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لله، وَالْحَمْدُ لله لَا إِلَهَ إِلَّا الله، وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ». وَإِذَا أَصْبَحَ قَالَ: «أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لله»",
            "evidence": "رواه مسلم (۲۷۲۳)؛ عَنْ عَبْدِ الله بن مَسْعُود، قَالَ: كَانَ نَبِيُّ الله ﷺ، إِذَا أَمْسَى قَالَ: «أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لله، وَالْحَمْدُ لله لَا إِلَهَ إِلَّا الله، وَحْدَهُ لَا شَرِيكَ لَهُ» قَالَ: أُرَاهُ قَالَ فِيهِنَّ: «لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ» وَإِذَا أَصْبَحَ قَالَ ذَلِكَ أَيْضًا: «أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لله»"
          },
          {
            "id": 3,
            "quranic": false,
            "dua": "«بِسْمِ الله الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ، فِي الْأَرْضِ، وَلَا فِي السَّمَاءِ، وَهُوَ السَّمِيعُ الْعَلِيمُ، ثَلَاثَ مَرَّاتٍ»",
            "evidence": "رواه أبو داود (٥۰۸۸)؛ سَمِعْتُ رَسُولَ الله ﷺ يَقُولُ: «مَنْ قَالَ بِسْمِ الله الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ، فِي الْأَرْضِ، وَلَا فِي السَّمَاءِ، وَهُوَ السَّمِيعُ الْعَلِيمُ، ثَلَاثَ مَرَّاتٍ، لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ، حَتَّى يُصْبِحَ، وَمَنْ قَالَهَا حِينَ يُصْبِحُ ثَلَاثُ مَرَّاتٍ، لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُمْسِيَ». وهو في الصحيح المسند للإمام الوادعي رحمه الله"
          },
          {
            "id": 4,
            "quranic": false,
            "dua": "«اللهم بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ» وَإِذَا أَمْسَى فَلْيَقُل: «اللهمَّ بِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ المَصِيرُ»",
            "evidence": "رواه أبو داود (٥۰٦۸)؛ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ﷺ أَنَّهُ كَانَ يَقُولُ إِذَا أَصْبَحَ: «اللهم بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ» وَإِذَا أَمْسَى قَالَ: «اللهمَّ بِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ المَصِيرُ»"
          },
          {
            "id": 5,
            "quranic": false,
            "dua": "«اللهم فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، لَا إِلَهَ إِلَّا أَنْتَ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ  الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ»",
            "evidence": "رواه أحمد (٦۸٥۱)؛ عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ، قَالَ: أَتَيْتُ عَبْدَ الله بْنَ عَمْرِو بْنِ الْعَاصِ، فَقُلْتُ لَهُ: حَدِّثْنَا مَا سَمِعْتَ مِنْ رَسُولِ الله ﷺ، فَأَلْقَى بَيْنَ يَدَيَّ صَحِيفَةً، فَقَالَ: هَذَا مَا كَتَبَ لِي رَسُولُ الله ﷺ، فَنَظَرْتُ فِيهَا، فَإِذَا فِيهَا: أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ قَالَ: يَا رَسُولَ الله، عَلِّمْنِي مَا أَقُولُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ؟ فَقَالَ لَهُ رَسُولُ الله ﷺ: «يَا أَبَا بَكْرٍ، قُلْ: اللهم فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، لَا إِلَهَ إِلَّا أَنْتَ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ  الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ». وهو في الجامع الصحيح (۲/٥۳۳)، والصحيحة (٦۳)"
          },
          {
            "id": 6,
            "quranic": false,
            "dua": "«اللهم إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللهم إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللهم اسْتُرْ عَوْرَتِي وَآمِنْ رَوْعَاتِي، اللهم احْفَظْنِي مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي»",
            "evidence": "رواه أبو داود (٥۰۷٤)؛ ابْنَ عُمَرَ، يَقُولُ: لَمْ يَكُنْ رَسُولُ الله ﷺ يَدَعُ هَؤُلَاءِ الدَّعَوَاتِ، حِينَ يُمْسِي، وَحِينَ يُصْبِحُ: «اللهم إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللهم إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللهم اسْتُرْ عَوْرَتِي»، وَقَالَ عُثْمَانُ: «عَوْرَاتِي وَآمِنْ رَوْعَاتِي، اللهم احْفَظْنِي مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي». وصححه الشيخان الوادعي في الصحيح المسند، والألباني"
          },
          {
            "id": 7,
            "quranic": false,
            "dua": "«أَصْبَحْتُ أُثْنِيَ عَلَيْكَ حَمْدًا، وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا الله ثَلَاثًا». وَإِذَا أَمْسَى فَلْيَقُلْ: «أَمْسَيْتُ...»",
            "evidence": "رواه النسائي في الكبرى (۱۰۳۳۱)؛ عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ الله ﷺ: «إِذَا أَصْبَحَ أَحَدُكُمْ فَلْيَقُلْ: أَصْبَحْتُ أُثْنِيَ عَلَيْكَ حَمْدًا، وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا الله ثَلَاثًا، وَإِذَا أَمْسَى فَلْيَقُلْ مِثْلَ ذَلِكَ». وهو في الصحيح المسند مما ليس في الصحيحين للشيخ مقبل رحمه الله"
          },
          {
            "id": 8,
            "quranic": false,
            "dua": "«سُبْحَانَ الله وَبِحَمْدِهِ»، مِائَةَ مَرَّةٍ، حِينَ يُصْبِحُ وَحِينَ يُمْسِي",
            "evidence": "رواه مسلم (۲٦۹۱)؛ عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ الله ﷺ: «مَنْ قَالَ: حِينَ يُصْبِحُ وَحِينَ يُمْسِي: سُبْحَانَ الله وَبِحَمْدِهِ، مِائَةَ مَرَّةٍ، لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ، بِأَفْضَلَ مِمَّا جَاءَ بِهِ، إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ»"
          },
          {
            "id": 9,
            "quranic": false,
            "dua": "«لَا إِلَهَ إِلَّا الله وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ» (مِائَةَ مَرَّةٍ)",
            "evidence": "رواه البخاري (۳۲۹۳) ومسلم (۲٦۹۱)؛ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ الله ﷺ، قَالَ: «مَنْ قَالَ: لَا إِلَهَ إِلَّا الله وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، فِي يَوْمٍ مِائَةَ مَرَّةٍ، كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ، وَكُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ، وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ، يَوْمَهُ ذَلِكَ، حَتَّى يُمْسِيَ وَلَمْ يَأْتِ أَحَدٌ أَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ عَمِلَ أَكْثَرَ مِنْ ذَلِكَ»"
          },
          {
            "id": 10,
            "quranic": false,
            "dua": "«أو يقولها عشـرًا»",
            "evidence": "رواه أحمد (۲۳٥۱۸)؛ عَنْ أَبِي أَيُّوبَ الْأَنْصَارِيِّ، قَالَ: قَالَ رَسُولُ الله ﷺ: «مَنْ قَالَ إِذَا صَلَّى الصُّبْحَ: لَا إِلَهَ إِلَّا الله، وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ عَشْرَ مَرَّاتٍ، كُنَّ كَعَدْلِ أَرْبَعِ رِقَابٍ، وَكُتِبَ لَهُ بِهِنَّ عَشْرُ حَسَنَاتٍ، وَمُحِيَ عَنْهُ بِهِنَّ عَشْرُ سَيِّئَاتٍ، وَرُفِعَ لَهُ بِهِنَّ عَشْرُ دَرَجَاتٍ، وَكُنَّ لَهُ حَرَسًا مِنَ الشَّيْطَانِ حَتَّى يُمْسِيَ، وَإِذَا قَالَهَا بَعْدَ الْمَغْرِبِ فَمِثْلُ ذَلِكَ»"
          },
          {
            "id": 11,
            "quranic": false,
            "dua": "«أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ وَكَلِمَةِ الْإِخْلَاصِ، وَسُنَّةِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَمِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا». وَإِذَا أَمْسَى قَالَ: «أَمْسَيْنَا...» إلخ",
            "evidence": "رواه أحمد (۲۱۱٤٤)؛ عن عَبْدِ الرَّحْمَنِ بْنِ أَبْزَي، عَنْ أُبَيِّ بْنِ كَعْبٍ، قَالَ: كَانَ رَسُولُ الله ﷺ يُعَلِّمُنَا إِذَا أَصْبَحْنَا: «أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ وَكَلِمَةِ الْإِخْلَاصِ، وَسُنَّةِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَمِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا، وَمَا كَانَ مِنَ الْمُشْرِكِينَ» وَإِذَا أَمْسَيْنَا مِثْلَ ذَلِكَ"
          },
          {
            "id": 12,
            "quranic": false,
            "dua": "المُعَوِّذَاتُ: { قُلْ هُوَ ٱللَّهُ أَحَدٌ }  وَ { قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ }  وَ { قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ } ؛ ثلاثًا",
            "evidence": "رواه أحمد (۱۷۳۳٤)؛ عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ: لَقِيتُ رَسُولَ الله ﷺ، فَابْتَدَأْتُهُ فَأَخَذْتُ بِيَدِهِ، قَالَ: فَقُلْتُ: يَا رَسُولَ الله، مَا نَجَاةُ الْمُؤْمِنِ؟ قَالَ: «يَا عُقْبَةُ، احْرُسْ لِسَانَكَ، وَلْيَسَعْكَ بَيْتُكَ، وَابْكِ عَلَى خَطِيئَتِكَ» قَالَ: ثُمَّ لَقِيَنِي رَسُولُ الله ﷺ، فَابْتَدَأَنِي فَأَخَذَ بِيَدِي، فَقَالَ: «يَا عُقْبَةُ بْنُ عَامِرٍ، أَلَا أُعَلِّمُكَ خَيْرَ ثَلَاثِ سُوَرٍ أُنْزِلَتْ فِي التَّوْرَاةِ وَالْإِنْجِيلِ وَالزَّبُورِ وَالْفُرْقَانِ الْعَظِيمِ؟» قَالَ: قُلْتُ: بَلَى، جَعَلَنِي الله فِدَاكَ. قَالَ: فَأَقْرَأَنِي { قُلْ هُوَ ٱللَّهُ أَحَدٌ } وَ { قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ } وَ{ قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ } ثُمَّ قَالَ: «يَا عُقْبَةُ، لَا تَنْسَاهُنَّ، وَلَا تَبِتِ لَيْلَةً حَتَّى تَقْرَأَهُنَّ» قَالَ: فَمَا نَسِيتُهُنَّ قَطُّ مُنْذُ قَالَ: «لَا تَنْسَاهُنَّ»، وَمَا بِتُّ لَيْلَةً قَطُّ حَتَّى أَقْرَأَهُنَّ. 
ورواه النسائي في الكبرى (۷۸۱۱) بسند حسن، عَنْ مُعَاذِ بْنِ عَبْدِ الله، عَنْ أَبِيهِ، قَالَ: أَصَابَنَا طَشٌّ وَظُلْمَةٌ فَانْتَظَرْنَا رَسُولَ الله ﷺ لَيُصَلِّيَ لَنَا، ثُمَّ ذَكَرَ كَلَامًا مَعْنَاهُ، فَخَرَجَ فَقَالَ: «قُلْ» قُلْتُ: مَا أَقُولُ؟ قَالَ: « { قُلْ هُوَ ٱللَّهُ أَحَدٌ } [الإخلاص: ۱] وَالْمُعَوِّذَتَيْنِ حِينَ تُمْسِي، وَتُصْبِحُ ثَلَاثًا يَكْفِيكَ كُلَّ شَيْءٍ». وحسنه العلامة الألباني رحمه الله
"
          },
          {
            "id": 13,
            "quranic": false,
            "dua": "«سُبْحَانَ الله وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ» ثلاثًا، فِي الصَّبَاحِ",
            "evidence": "رواه مسلم (٦۲٦۸)؛ عَنْ جُوَيْرِيَةَ، أَنَّ النَّبِيَّ ﷺ خَرَجَ مِنْ عِنْدِهَا بُكْرَةً حِينَ صَلَّى الصُّبْحَ، وَهِيَ فِي مَسْجِدِهَا، ثُمَّ رَجَعَ بَعْدَ أَنْ أَضْحَى، وَهِيَ جَالِسَةٌ، فَقَالَ: «مَا زِلْتِ عَلَى الْحَالِ الَّتِي فَارَقْتُكِ عَلَيْهَا؟» قَالَتْ: نَعَمْ، قَالَ النَّبِيُّ ﷺ: «لَقَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ، ثَلَاثَ مَرَّاتٍ، لَوْ وُزِنَتْ بِمَا قُلْتِ مُنْذُ الْيَوْمِ لَوَزَنَتْهُنَّ: سُبْحَانَ الله وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ»"
          },
          {
            "id": 14,
            "quranic": false,
            "dua": "«أَعُوذُ بِكَلِمَاتِ الله التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ»، مَرَّةً وَاحِدَةً، فِي المَسَاءِ",
            "evidence": "رواه مسلم (۲۷۰۹)؛  عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ: جَاءَ رَجُلٌ إِلَى النَّبِيِّ ﷺ فَقَالَ: يَا رَسُولَ الله مَا لَقِيتُ مِنْ عَقْرَبٍ لَدَغَتْنِي الْبَارِحَةَ، قَالَ: «أَمَا لَوْ قُلْتَ، حِينَ أَمْسَيْتَ: أَعُوذُ بِكَلِمَاتِ الله التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ، لَمْ تَضُرَّكَ»"
          },
          {
            "id": 15,
            "quranic": true,
            "dua": "«الْآيَتَانِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ» \ufd5f ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيْهِ مِن رَّبِّهِۦ وَٱلْمُؤْمِنُونَ ۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَـٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيْنَ أَحَدٍۢ مِّن رُّسُلِهِۦ ۚ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ ٱلْمَصِيرُ \u0665\u0668\u0662  لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا ٱكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًا كَمَا حَمَلْتَهُۥ عَلَى ٱلَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ وَٱعْفُ عَنَّا وَٱغْفِرْ لَنَا وَٱرْحَمْنَآ ۚ أَنتَ مَوْلَىٰنَا فَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَـٰفِرِينَ  \u0666\u0668\u0662 \ufd5e [البقرة]",
            "evidence": "رواه البخاري (٤۰۰۸) ومسلم (۸۰۷)؛ عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ، رضي الله عنه، قَالَ: قَالَ رَسُولُ الله ﷺ: «الآيَتَانِ مِنْ آخِرِ سُورَةِ البَقَرَةِ، مَنْ قَرَأَهُمَا فِي لَيْلَةٍ كَفَتَاهُ»"
          },
          {
            "id": 16,
            "quranic": true,
            "dua": "آيَةُ الْكُرْسِيّ : \ufd5f ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ ۚ لَا تَأْخُذُهُۥ سِنَةٌ وَلَا نَوْمٌ  ۚ لَّهُۥ مَا فِى ٱلسَّمَـٰوَٰتِ وَمَا فِى ٱلْأَرْضِ ۗ مَن ذَا ٱلَّذِى يَشْفَعُ عِندَهُۥٓ إِلَّا بِإِذْنِهِۦ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَىْءٍۢ مِّنْ عِلْمِهِۦٓ إِلَّا بِمَا شَآءَ ۚ وَسِعَ كُرْسِيُّهُ ٱلسَّمَـٰوَٰتِ وَٱلْأَرْضَ ۖ وَلَا يَـُٔودُهُۥ حِفْظُهُمَا ۚ وَهُوَ ٱلْعَلِىُّ ٱلْعَظِيمُ \u0665\u0665\u0662 \ufd5e [البقرة] ",
            "evidence": "رواه الحاكم في المستدرك بسند صحيح (۲۰٦٤)؛ عَن أُبَيِّ بْنِ كَعْبٍ رضي الله عنه، أَنَّهُ كَانَ لَهُ جَرِينُ تَمْرٍ فَكَانَ يَجِدُهُ يَنْقُصُ فَحَرَسَهُ لَيْلَةً، فَإِذَا هُوَ بِمِثْلِ الْغُلَامِ الْمُحْتَلِمِ فَسَلَّمَ عَلَيْهِ فَرَدَّ عليه السلام ، فَقَالَ: أَجِنِّيٌّ، أَمْ إِنْسِيٌّ؟ فَقَالَ: بَلْ جِنِّيٌّ، فَقَالَ: أَرِنِي يَدَكَ فَأَرَاهُ، فَإِذَا يَدُ كَلْبٍ وَشَعْرُ كَلْبٍ، فَقَالَ: هَكَذَا خَلْقُ الْجِنِّ، فَقَالَ: لَقَدْ عَلِمَتِ الْجِنُّ إِنَّهُ لَيْسَ فِيهِمْ رَجُلٌ أَشَدُّ مِنِّي، قَالَ: مَا جَاءَ بِكَ، قَالَ: أُنْبِئْنَا أَنَّكَ تُحِبُّ الصَّدَقَةَ فَجِئْنَا نُصِيبُ مِنْ طَعَامِكَ، قَالَ: مَا يُجِيرُنَا مِنْكُمْ؟ قَالَ: تَقْرَأُ آيَةَ الْكُرْسِيِّ مِنْ سُورَةِ الْبَقَرَةِ { ٱللَّهُ لَآ إِلَـٰهَ إِلَّا هُوَ ٱلْحَىُّ ٱلْقَيُّومُ } [البقرة: ۲٥٥] قَالَ: نَعَمْ، قَالَ: إِذَا قَرَأْتَهَا غُدْوَةً أُجِرْتَ مِنَّا حَتَّى تُمْسِيَ، وَإِذَا قَرَأْتَهَا حِينَ تُمْسِي أُجِرْتَ مِنَّا حَتَّى تُصْبِحَ، قَالَ أُبَيٌّ فَغَدَوْتُ إِلَى رَسُولِ الله ﷺ فَأَخْبَرْتُهُ بِذَلِكَ، فَقَالَ: «صَدَقَ الْخَبِيثُ». أخرجه الحاكم (۱/٥٦۲)، وقال: هذا حديث صحيح الإسناد ولم يخرجاه. وهو كما قال؛ وصححه الألباني رحمه الله "
          }
        ]
      }      
    ]
"""//.trimIndent()
    }
}
