package com.itsi.almuntaqimorevn.model

class DuaData {

    companion object {
        const val hardcodedJsonDataAsString: String = """
    [
      {
        "ch_id": 0,
        "ch_name": "باب الأذكار الصحيحة عن رسول الله ﷺ من أذكار الصباح والمساء (1) ",
        "ch_evidence": "",
        "duas": [
          {
            "id": 1,
            "dua": "عن شَدَّاد بْنُ أَوْسٍ : عَنِ النَّبِيِّ ﷺ: <font color='#D2042D'>«سَيِّدُ الِاسْتِغْفَارِ أَنْ تَقُولَ:«اللهمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ»<\/font>",
            "evidence": "رواه البخاري (6306)"
          },
          {
            "id": 2,
            "dua": "عَنْ عَبْدِ الله بن مَسْعُود، قَالَ: كَانَ نَبِيُّ الله ﷺ، إِذَا أَمْسَى قَالَ: «  أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لله، وَالْحَمْدُ لله لَا إِلَهَ إِلَّا الله، وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ  ». وَإِذَا أَصْبَحَ قَالَ: «أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لله»",
            "evidence": "رواه مسلم (2723)"
          },
          {
            "id": 3,
            "dua": "عن عثمان، سَمِعْتُ رَسُولَ الله  يَقُولُ: «مَنْ قَالَ «بِسْمِ الله الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ، فِي الْأَرْضِ، وَلَا فِي السَّمَاءِ، وَهُوَ السَّمِيعُ الْعَلِيمُ، ثَلَاثَ مَرَّاتٍ لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ، حَتَّى يُصْبِحَ، وَمَنْ قَالَهَا حِينَ يُصْبِحُ ثَلَاثُ مَرَّاتٍ، لَمْ تُصِبْهُ فَجْأَةُ بَلَاءٍ حَتَّى يُمْسِيَ»",
            "evidence": "رواه أبو داود (5088)"
          },
          {
            "id": 4,
            "dua": "اللهمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ النُّشُورُ» وَإِذَا أَمْسَى فَلْيَقُل: عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ﷺ أَنَّهُ كَانَ يَقُولُ إِذَا أَصْبَحَ: «اللهمَّ بِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ المَصِيرُ» وَإِذَا أَمْسَى قَالَ: «اللهمَّ بِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ، وَإِلَيْكَ المَصِيرُ»",
            "evidence": "رواه أبو داود (5068)"
          },
          {
            "id": 5,
            "dua": "عَنْ أَبِي رَاشِدٍ الْحُبْرَانِيِّ، قَالَ: أَتَيْتُ عَبْدَ الله بْنَ عَمْرِو بْنِ الْعَاصِ، فَقُلْتُ لَهُ: حَدِّثْنَا مَا سَمِعْتَ مِنْ رَسُولِ الله ﷺ، فَأَلْقَى بَيْنَ يَدَيَّ صَحِيفَةً، فَقَالَ: هَذَا مَا كَتَبَ لِي رَسُولُ الله ﷺ، فَنَظَرْتُ فِيهَا، فَإِذَا فِيهَا: أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ قَالَ: يَا رَسُولَ الله، عَلِّمْنِي مَا أَقُولُ إِذَا أَصْبَحْتُ وَإِذَا أَمْسَيْتُ؟ فَقَالَ لَهُ رَسُولُ الله ﷺ: «يَا أَبَا بَكْرٍ، قُلْ: «اللهمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، لَا إِلَهَ إِلَّا أَنْتَ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ  الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ»",
            "evidence": "رواه أحمد (6851)"
          },
          {
            "id": 6,
            "dua": "عن ابْنَ عُمَرَ، يَقُولُ: لَمْ يَكُنْ رَسُولُ الله ﷺ يَدَعُ هَؤُلَاءِ الدَّعَوَاتِ، حِينَ يُمْسِي، وَحِينَ يُصْبِحُ: «اللهمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللهمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللهمَّ اسْتُرْ عَوْرَتِي وَآمِنْ رَوْعَاتِي، اللهمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي»",
            "evidence": "رواه أبو داود (5074)"
          },
          {
            "id": 7,
            "dua": "عَنْ أَبِي هُرَيْرَةَ، قَالَ: قَالَ رَسُولُ الله ﷺ: «أَصْبَحْتُ أُثْنِيَ عَلَيْكَ حَمْدًا، وَأَشْهَدُ أَنْ لَا إِلَهَ إِلَّا الله ثَلَاثًا». وَإِذَا أَمْسَى فَلْيَقُلْ: «أَمْسَيْتُ...»",
            "evidence": "رواه النسائي في الكبرى (10331)"
          }
        ]
      }      
    ]
"""//.trimIndent()
    }
}
